CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_syscfg.h
/*!
   \file    gd32a50x_syscfg.h
   \brief   definitions for the SYSCFG

    \version 2024-12-06, V1.4.0, firmware for GD32A50x
*/

/*
    Copyright (c) 2024, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A50X_SYSCFG_H
#define GD32A50X_SYSCFG_H

#include "gd32a50x.h"

/* SYSCFG definitions */
#define SYSCFG                                         SYSCFG_BASE

/* registers definitions */
#define SYSCFG_CFG0                                    REG32(SYSCFG + 0x00000000U)                /*!< system configuration register 0 */
#define SYSCFG_CFG1                                    REG32(SYSCFG + 0x00000004U)                /*!< system configuration register 1 */
#define SYSCFG_EXTISS0                                 REG32(SYSCFG + 0x00000008U)                /*!< EXTI sources selection register 0 */
#define SYSCFG_EXTISS1                                 REG32(SYSCFG + 0x0000000CU)                /*!< EXTI sources selection register 1 */
#define SYSCFG_EXTISS2                                 REG32(SYSCFG + 0x00000010U)                /*!< EXTI sources selection register 2 */
#define SYSCFG_EXTISS3                                 REG32(SYSCFG + 0x00000014U)                /*!< EXTI sources selection register 3 */
#define SYSCFG_CFG2                                    REG32(SYSCFG + 0x00000018U)                /*!< system configuration register 2 */
#define SYSCFG_STAT                                    REG32(SYSCFG + 0x0000001CU)                /*!< system status register */
#define SYSCFG_CFG3                                    REG32(SYSCFG + 0x00000028U)                /*!< system configuration register 3 */
#define SYSCFG_TIMERINSEL                              REG32(SYSCFG + 0x0000002CU)                /*!< TIMER input source selection register */

/* bits definitions */
/* SYSCFG_CFG0 */
#define SYSCFG_CFG0_BOOT_MODE                          BIT(0)                                     /*!< SYSCFG memory remap configuration */
#define SYSCFG_CFG0_PA9_PA12_RMP                       BIT(4)                                     /*!< PA9 and PA12 remapping bit for small packages (32 pins) */
#define SYSCFG_CFG0_BOOT0_PF0_RMP                      BIT(6)                                     /*!< BOOT0 and PF0 remapping bit */

/* SYSCFG_CFG1 */
#define SYSCFG_CFG1_ADC1CH14RMP                        BIT(28)                                    /*!< ADC1 channel 14 remapping bit */
#define SYSCFG_CFG1_ADC1CH15RMP                        BIT(29)                                    /*!< ADC1 channel 15 remapping bit */
#define SYSCFG_CFG1_ADC0CH8RMP                         BIT(30)                                    /*!< ADC0 channel 8 remapping bit */
#define SYSCFG_CFG1_ADC0CH9RMP                         BIT(31)                                    /*!< ADC0 channel 9 remapping bit */

/* SYSCFG_EXTISS0 */
#define SYSCFG_EXTISS0_EXTI0_SS                        BITS(0,3)                                  /*!< EXTI 0 configuration */
#define SYSCFG_EXTISS0_EXTI1_SS                        BITS(4,7)                                  /*!< EXTI 1 configuration */
#define SYSCFG_EXTISS0_EXTI2_SS                        BITS(8,11)                                 /*!< EXTI 2 configuration */
#define SYSCFG_EXTISS0_EXTI3_SS                        BITS(12,15)                                /*!< EXTI 3 configuration */

/* SYSCFG_EXTISS1 */
#define SYSCFG_EXTISS1_EXTI4_SS                        BITS(0,3)                                  /*!< EXTI 4 configuration */
#define SYSCFG_EXTISS1_EXTI5_SS                        BITS(4,7)                                  /*!< EXTI 5 configuration */
#define SYSCFG_EXTISS1_EXTI6_SS                        BITS(8,11)                                 /*!< EXTI 6 configuration */
#define SYSCFG_EXTISS1_EXTI7_SS                        BITS(12,15)                                /*!< EXTI 7 configuration */

/* SYSCFG_EXTISS2 */
#define SYSCFG_EXTISS2_EXTI8_SS                        BITS(0,3)                                  /*!< EXTI 8 configuration */
#define SYSCFG_EXTISS2_EXTI9_SS                        BITS(4,7)                                  /*!< EXTI 9 configuration */
#define SYSCFG_EXTISS2_EXTI10_SS                       BITS(8,11)                                 /*!< EXTI 10 configuration */
#define SYSCFG_EXTISS2_EXTI11_SS                       BITS(12,15)                                /*!< EXTI 11 configuration */

/* SYSCFG_EXTISS3 */
#define SYSCFG_EXTISS3_EXTI12_SS                       BITS(0,3)                                  /*!< EXTI 12 configuration */
#define SYSCFG_EXTISS3_EXTI13_SS                       BITS(4,7)                                  /*!< EXTI 13 configuration */
#define SYSCFG_EXTISS3_EXTI14_SS                       BITS(8,11)                                 /*!< EXTI 14 configuration */
#define SYSCFG_EXTISS3_EXTI15_SS                       BITS(12,15)                                /*!< EXTI 15 configuration */

/* SSYSCFG_CFG2 */
#define SYSCFG_CFG2_LOCKUP_LOCK                        BIT(0)                                     /*!< Cortex-M33 LOCKUP output lock bit */
#define SYSCFG_CFG2_SRAM_ECC_ERROR_LOCK                BIT(1)                                     /*!< SRAM ECC check error lock bit */
#define SYSCFG_CFG2_LVD_LOCK                           BIT(2)                                     /*!< LVD lock bit */

/* SYSCFG_STAT */
#define SYSCFG_STAT_SRAMECCMEIF                        BIT(0)                                     /*!< SRAM multi-bits non-correction event flag */
#define SYSCFG_STAT_SRAMECCSEIF                        BIT(1)                                     /*!< SRAM single bit correction event flag */
#define SYSCFG_STAT_FLASHECCIF                         BIT(2)                                     /*!< Flash ECC NMI interrupt flag */
#define SYSCFG_STAT_CKMNMIIF                           BIT(3)                                     /*!< HXTAL clock moniotor NMI interrupt flag */
#define SYSCFG_STAT_NMIPINIF                           BIT(4)                                     /*!< NMI interrupt flag from nmi pin */

