CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_syscfg.h
/* SSYSCFG_CFG3 */
#define SYSCFG_CFG3_SRAMECCMEIE                        BIT(0)                                     /*!< SRAM multi-bits non-correction NMI interrupt enable */
#define SYSCFG_CFG3_SRAMECCSEIE                        BIT(1)                                     /*!< SRAM single bit correction interrupt enable */
#define SYSCFG_CFG3_FLASHECCIE                         BIT(2)                                     /*!< Flash ECC NMI interrupt enable */
#define SYSCFG_CFG3_CKMNMIIE                           BIT(3)                                     /*!< HXTAL clock moniotor NMI interrupt enable */
#define SYSCFG_CFG3_NMIPINIE                           BIT(4)                                     /*!< NMI pin interrupt enable */
#define SYSCFG_CFG3_SRAMECCSERRBITS                    BITS(12,17)                                /*!< which one bit has an SRAM ECC single-bit correctable error */
#define SYSCFG_CFG3_SRAMECCEADDR                       BITS(18,31)                                /*!< record the faulting system address (Address[15:0] >> 2) where the last SRAM ECC event on SRAM occurred. */

/* SYSCFG_TIMERINSEL */
#define SYSCFG_TIMERINSEL_TIMER7_CH0N_SEL              BIT(0)                                     /*!< TIMER7 channel 0 complementary input selection */
#define SYSCFG_TIMERINSEL_TIMER20_BKIN3_SEL            BIT(2)                                     /*!< TIMER20 break input 3 selection */
#define SYSCFG_TIMERINSEL_TIMER20_BKIN2_SEL            BIT(3)                                     /*!< TIMER20 break input 2 selection */
#define SYSCFG_TIMERINSEL_TIMER20_BKIN1_SEL            BIT(4)                                     /*!< TIMER20 break input 1 selection */
#define SYSCFG_TIMERINSEL_TIMER20_BKIN0_SEL            BIT(5)                                     /*!< TIMER20 break input 0 selection */
#define SYSCFG_TIMERINSEL_TIMER19_BKIN3_SEL            BIT(6)                                     /*!< TIMER19 break input 3 selection */
#define SYSCFG_TIMERINSEL_TIMER19_BKIN2_SEL            BIT(7)                                     /*!< TIMER19 break input 2 selection */
#define SYSCFG_TIMERINSEL_TIMER19_BKIN1_SEL            BIT(8)                                     /*!< TIMER19 break input 1 selection */
#define SYSCFG_TIMERINSEL_TIMER19_BKIN0_SEL            BIT(9)                                     /*!< TIMER19 break input 0 selection */
#define SYSCFG_TIMERINSEL_TIMER7_BKIN3_SEL             BIT(14)                                    /*!< TIMER7 break input 3 selection */
#define SYSCFG_TIMERINSEL_TIMER7_BKIN2_SEL             BIT(15)                                    /*!< TIMER7 break input 2 selection */
#define SYSCFG_TIMERINSEL_TIMER7_BKIN1_SEL             BIT(16)                                    /*!< TIMER7 break input 1 selection */
#define SYSCFG_TIMERINSEL_TIMER7_BKIN0_SEL             BIT(17)                                    /*!< TIMER7 break input 0 selection */
#define SYSCFG_TIMERINSEL_TIMER0_BKIN3_SEL             BIT(18)                                    /*!< TIMER0 break input 3 selection */
#define SYSCFG_TIMERINSEL_TIMER0_BKIN2_SEL             BIT(19)                                    /*!< TIMER0 break input 2 selection */
#define SYSCFG_TIMERINSEL_TIMER0_BKIN1_SEL             BIT(20)                                    /*!< TIMER0 break input 1 selection */
#define SYSCFG_TIMERINSEL_TIMER0_BKIN0_SEL             BIT(21)                                    /*!< TIMER0 break input 0 selection */
#define SYSCFG_TIMERINSEL_TIMER20_ETI_SEL              BITS(22,23)                                /*!< TIMER20 external trigger selection */
#define SYSCFG_TIMERINSEL_TIMER19_ETI_SEL              BITS(24,25)                                /*!< TIMER19 external trigger selection */
#define SYSCFG_TIMERINSEL_TIMER7_ETI_SEL               BITS(28,29)                                /*!< TIMER7 external trigger selection */
#define SYSCFG_TIMERINSEL_TIMER0_ETI_SEL               BITS(30,31)                                /*!< TIMER0 external trigger selection */

/* constants definitions */
/* boot mode definitions */
#define SYSCFG_BOOTMODE_FLASH                         ((uint8_t)0x00U)                            /*!< boot from main flash */
#define SYSCFG_BOOTMODE_SYSTEM                        ((uint8_t)0x01U)                            /*!< boot from system flash memory */

/* PA9/PA12 remap definitions */
#define SYSCFG_PA9_PA12_REMAP                         SYSCFG_CFG0_PA9_PA12_RMP                    /*!< PA9/PA12 pins are mapping on PA10/PA11 pins */

/* PF0/BOOT0 remap definitions */
#define SYSCFG_BOOT0_REMAP_PF0                        SYSCFG_CFG0_BOOT0_PF0_RMP                   /*!< PF0 pin is mapping on the BOOT0 pin */

/* EXTI source select definition */
#define EXTISS0                                       ((uint8_t)0x00U)                            /*!< EXTI source select register 0 */
#define EXTISS1                                       ((uint8_t)0x01U)                            /*!< EXTI source select register 1 */
#define EXTISS2                                       ((uint8_t)0x02U)                            /*!< EXTI source select register 2 */
#define EXTISS3                                       ((uint8_t)0x03U)                            /*!< EXTI source select register 3 */

/* EXTI source select mask bits definition */
#define EXTI_SS_MASK                                  BITS(0,3)                                   /*!< EXTI source select mask */

/* EXTI source select jumping step definition */
#define EXTI_SS_JSTEP                                 ((uint8_t)(0x04U))                          /*!< EXTI source select jumping step */

/* EXTI source select moving step definition */
#define EXTI_SS_MSTEP(pin)                            (EXTI_SS_JSTEP * ((pin) % EXTI_SS_JSTEP))   /*!< EXTI source select moving step */

/* EXTI source port definitions */
#define EXTI_SOURCE_GPIOA                             ((uint8_t)0x00U)                            /*!< EXTI GPIOA configuration */
#define EXTI_SOURCE_GPIOB                             ((uint8_t)0x01U)                            /*!< EXTI GPIOB configuration */
#define EXTI_SOURCE_GPIOC                             ((uint8_t)0x02U)                            /*!< EXTI GPIOC configuration */
#define EXTI_SOURCE_GPIOD                             ((uint8_t)0x03U)                            /*!< EXTI GPIOD configuration */
#define EXTI_SOURCE_GPIOE                             ((uint8_t)0x04U)                            /*!< EXTI GPIOE configuration */
#define EXTI_SOURCE_GPIOF                             ((uint8_t)0x05U)                            /*!< EXTI GPIOF configuration */

/* EXTI source pin definitions */
#define EXTI_SOURCE_PIN0                              ((uint8_t)0x00U)                            /*!< EXTI GPIO pin0 configuration */
#define EXTI_SOURCE_PIN1                              ((uint8_t)0x01U)                            /*!< EXTI GPIO pin1 configuration */
#define EXTI_SOURCE_PIN2                              ((uint8_t)0x02U)                            /*!< EXTI GPIO pin2 configuration */
#define EXTI_SOURCE_PIN3                              ((uint8_t)0x03U)                            /*!< EXTI GPIO pin3 configuration */
#define EXTI_SOURCE_PIN4                              ((uint8_t)0x04U)                            /*!< EXTI GPIO pin4 configuration */
#define EXTI_SOURCE_PIN5                              ((uint8_t)0x05U)                            /*!< EXTI GPIO pin5 configuration */
#define EXTI_SOURCE_PIN6                              ((uint8_t)0x06U)                            /*!< EXTI GPIO pin6 configuration */
#define EXTI_SOURCE_PIN7                              ((uint8_t)0x07U)                            /*!< EXTI GPIO pin7 configuration */
#define EXTI_SOURCE_PIN8                              ((uint8_t)0x08U)                            /*!< EXTI GPIO pin8 configuration */
#define EXTI_SOURCE_PIN9                              ((uint8_t)0x09U)                            /*!< EXTI GPIO pin9 configuration */
#define EXTI_SOURCE_PIN10                             ((uint8_t)0x0AU)                            /*!< EXTI GPIO pin10 configuration */
#define EXTI_SOURCE_PIN11                             ((uint8_t)0x0BU)                            /*!< EXTI GPIO pin11 configuration */
#define EXTI_SOURCE_PIN12                             ((uint8_t)0x0CU)                            /*!< EXTI GPIO pin12 configuration */
#define EXTI_SOURCE_PIN13                             ((uint8_t)0x0DU)                            /*!< EXTI GPIO pin13 configuration */
#define EXTI_SOURCE_PIN14                             ((uint8_t)0x0EU)                            /*!< EXTI GPIO pin14 configuration */
#define EXTI_SOURCE_PIN15                             ((uint8_t)0x0FU)                            /*!< EXTI GPIO pin15 configuration */

