CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_syscfg.h
typedef enum {
    TIMER0SEL = 1U,                                    /*!< select TIMER0 */
    TIMER7SEL,                                         /*!< select TIMER7 */
    TIMER19SEL,                                        /*!< select TIMER19 */
    TIMER20SEL,                                        /*!< select TIMER20 */
} syscfg_timersel_enum;

/* function declarations */
/* initialization functions */
/* reset the SYSCFG registers */
void syscfg_deinit(void);

/* configure the GPIO pin as EXTI Line */
void syscfg_exti_line_config(uint8_t exti_port, uint8_t exti_pin);

/* enable remap pin function */
void syscfg_pin_remap_enable(uint32_t remap_pin);
/* disable remap pin function */
void syscfg_pin_remap_disable(uint32_t remap_pin);
/* configure ADC channel GPIO pin remap function */
void syscfg_adc_ch_remap_config(syscfg_adcx_chy_enum adcx_iny_remap, ControlStatus newvalue);

/* select TIMER external trigger source */
void syscfg_timer_eti_sel(syscfg_timersel_enum timer_num, uint32_t eti_num);
/* select TRIGSEL as TIMER break input source */
void syscfg_timer_bkin_select_trigsel(uint32_t bkin_source);
/* select GPIO as TIMER break input source */
void syscfg_timer_bkin_select_gpio(uint32_t bkin_source);
/* select TIMER7 channel0 complementary input source */
void syscfg_timer7_ch0n_select(uint32_t timer7_ch0n_in);

/* configure TIMER0/7/19/20 break input to the selected parameter connection */
void syscfg_lock_config(uint32_t syscfg_lock);

/* flag and interrupt functions */
/* get SYSCFG flags */
FlagStatus syscfg_flag_get(uint32_t flag);
/* clear SYSCFG flags */
void syscfg_flag_clear(uint32_t flag);
/* enable SYSCFG interrupts */
void syscfg_interrupt_enable(uint32_t interrupt);
/* disable SYSCFG interrupts */
void syscfg_interrupt_disable(uint32_t interrupt);
/* get SYSCFG interrupt flag status */
FlagStatus syscfg_interrupt_flag_get(uint32_t interrupt);
/* get the current boot mode */
uint8_t syscfg_bootmode_get(void);
/* get the address where SRAM ECC error occur on */
uint16_t syscfg_sram_ecc_address_get(void);
/* get the bit which has SRAM ECC signle error */
uint8_t syscfg_sram_ecc_bit_get(void);

#endif /* GD32A50X_SYSCFG_H */
